Table of Contents
 Class IdeaConnectionControllerGrpc
Namespace
IdeaStatiCa.Plugin
Assembly
IdeaStatiCa.Plugin.dll
[Obsolete("This class will be replaced by IdeaConnectionController controller.")]
public class IdeaConnectionControllerGrpc : IdeaConnectionController, IDisposable, IConnectionController
Inheritance
object
IdeaConnectionController
IdeaConnectionControllerGrpc
Implements
IDisposable
IConnectionController
Inherited Members
 IdeaConnectionController.ConnectionAppExited
 IdeaConnectionController.CurrentItemChangedEvent
 IdeaConnectionController.GrpcClient
 IdeaConnectionController.UserMode
 IdeaConnectionController.Create(string)
 IdeaConnectionController.OpenProject(string)
 IdeaConnectionController.CloseProject()
 IdeaConnectionController.OpenConnectionClient()
 IdeaConnectionController.Dispose(bool)
 IdeaConnectionController.Dispose()
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Methods
 Create(string, IPluginLogger)
Creates connection and starts IDEA StatiCa connection application. Call OpenProject after this method to open specific project.
public static IConnectionController Create(string ideaInstallDir, IPluginLogger logger)
Parameters
ideaInstallDir string
IDEA StatiCa installation directory.
logger IPluginLogger
The logger.
Returns
IConnectionController
A controller object.
 Edit this page